uhnp/src/InformationRegisters/ВыборПараметровУчетаФИ/ВыборПараметровУчетаФИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВыборПараметровУчетаФИ</name>
  <resources>
    <name>БизнесМодель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БизнесМодельДолевой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидИнструмента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Лизинг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Лизинг10</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Лизинг11</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Лизинг12</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Лизинг13</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Лизинг14</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Лизинг15</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Лизинг21</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Лизинг22</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Лизинг23</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Лизинг31</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Лизинг32</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Лизинг41</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПараметрыУчетаФИ</name>
    <type>
      <types>CatalogRef.ПараметрыУчетаФинансовыхИнструментовМСФО</types>
    </type>
  </resources>
  <resources>
    <name>ПлатежиВключают</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СнизитьРискССПСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СнизитьРискССЧПУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ФИ</name>
    <type>
      <types>DefinedType.ФинансовыйИнструмент</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ВыборПараметровУчетаФИ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура СохранитьВыбор(ФИ, ПараметрыВыбора, Отказ) Экспорт

	мз = РегистрыСведений.ВыборПараметровУчетаФИ.СоздатьМенеджерЗаписи();
	мз.ФИ = ФИ;
	мз.Прочитать();
	
	ЗаполнитьЗначенияСвойств(мз, ПараметрыВыбора);
	мз.ФИ = ФИ;
	
	Попытка
	    мз.Записать(Истина);
	Исключение		
		ТекстСообщения = НСтр("ru = 'Не удалось записать выбор параметров учета финансового инструмента <%1>: '");
		ОбщегоНазначенияУХ.СообщитьОбОшибке(СтрШаблон(ТекстСообщения + ОписаниеОшибки(), ФИ), Отказ);			
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьТекстВыбора(ФИ, ПараметрыВыбораФИ = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПараметрыВыбораФИ = Неопределено Тогда
		РеквизитыФИ = РегистрыСведений.ВыборПараметровУчетаФИ.Получить(Новый Структура("ФИ", ФИ));
	Иначе	
		РеквизитыФИ = ПараметрыВыбораФИ;
	КонецЕсли;	
	
	мд = Метаданные.РегистрыСведений.ВыборПараметровУчетаФИ.Ресурсы;
	
	ВидимостьПараметровВыбора = УчетФинансовыхИнструментовМСФОКлиентСерверУХ.ПолучитьВидимостьПараметрыВыбораФИ(РеквизитыФИ);
	
	ТекстВыбора = Новый Массив;
	Для каждого ТекущийРеквизит Из РеквизитыФИ Цикл
		
		Если Не ВидимостьПараметровВыбора.Свойство(ТекущийРеквизит.Ключ) Тогда
			Продолжить;
		ИначеЕсли (ТекущийРеквизит.Ключ <> "Лизинг") И (ТипЗнч(ТекущийРеквизит.Значение) = Тип("Булево")) И (ТекущийРеквизит.Значение = Ложь) Тогда
			Продолжить;	
		КонецЕсли;
		
		Если ТекущийРеквизит.Ключ = "Лизинг" Тогда			
			ТекстВыбора.Добавить( ?(ТекущийРеквизит.Значение, НСтр("ru = 'Аренда (IFRS 16)'"), НСтр("ru = 'Финансовый инструмент (IFRS 9)'")));
			Продолжить;
		КонецЕсли;
				
		ВывестиЗначение = (ТипЗнч(ТекущийРеквизит.Значение) <> Тип("Булево")) Или (ТекущийРеквизит.Значение <> Истина);
		ТекущееЗначениеВыбора = ?(ВывестиЗначение, ": " + ЗначениеРеквизита(ТекущийРеквизит.Ключ, ТекущийРеквизит.Значение), "");
		
		ТекстВыбора.Добавить(мд[ТекущийРеквизит.Ключ].Синоним + ТекущееЗначениеВыбора);
	
	КонецЦикла;
	
	Возврат	СтрСоединить(ТекстВыбора, ", " + Символы.ПС);

КонецФункции

Функция ЗначениеРеквизита(ИмяРеквизита, НомерЗначения)

	Если ИмяРеквизита = "ВидИнструмента" Тогда
		Возврат ?(НомерЗначения = 0, НСтр("ru = 'Долговой инструмент (кредиты, займы, задолженность)'") , НСтр("ru = 'Долевой инструмент (акции)'"));
	ИначеЕсли ИмяРеквизита = "БизнесМодель" Тогда
		Возврат ?(НомерЗначения = 0, НСтр("ru = 'не предусматривает продажи / переуступки вообще'"), 
						?(НомерЗначения = 1, НСтр("ru = 'продажа / переуступка возможна'"), НСтр("ru = 'продажа / переуступка  - основная цель'")));
	ИначеЕсли ИмяРеквизита = "БизнесМодельДолевой" Тогда
		Возврат ?(НомерЗначения = 0, НСтр("ru = 'не предусматривает продажи / переуступки вообще'"), 
						?(НомерЗначения = 1, НСтр("ru = 'продажа / переуступка возможна'"), НСтр("ru = 'продажа / переуступка  - основная цель'")));
	ИначеЕсли ИмяРеквизита = "ПлатежиВключают" Тогда
		Возврат ?(НомерЗначения = 0, НСтр("ru = 'только долг и проценты'"), НСтр("ru = 'есть дополнительные комиссии, условные платежи или иное'"));
	Иначе 
		Возврат НомерЗначения;
	КонецЕсли;

КонецФункции

#КонецЕсли
